import time
from train import Config
from utils import load_model, translate, bleu_score


def test():
    config = Config()
    tokenizer, model = load_model(config.model_path, config)

    texts = [
        {
            "input": "又，《春秋》亦有遇礼，何为不可乎！",
            "output": "再有，《春秋》当中也有路途相遇的礼节，又有什么不可以的呢！",
        },
        {
            "input": "五年春正月，行幸犲山宫，遂如参合陂，观渔于延水，至宁川。三月，姚兴遣使朝贡。是岁，皇孙焘生。",
            "output": "五年春正月，皇帝临幸犲山宫，随后前往参合陂，在延水边观看捕鱼，抵达宁川。三月，姚兴派使者前来朝贡。这一岁，皇孙焘出生。",
        },
        {
            "input": "孔子曰： 吾观于乡，而知王道之易易也。",
            "output": "孔子说； 我参观过乡饮酒礼以后，就知道了王者的教化得到推行是很容易的事。",
        },
        {
            "input": "桓桓武王，继世灭殷。咸任尚父，且作商臣。功冒四海，救世济民。天下宗周，万国是宾。",
            "output": "桓桓武王，继承帝位消灭商朝。众人都称他为尚父，并且他做出了很多有益于商朝百姓的事情。他的功绩传遍四海，拯救了大众，帮助国家兴盛。全世界都尊奉周朝为宗，万国都是周朝的臣民。",
        },
        {
            "input": "【太平令】俺小姐这一个有千般娇态，新状元有万种襟怀。荷皇恩荣升宠赍，成配偶不胜感戴。端的个美哉，壮哉，这都是圣裁。（院公上云）喏！报的夫人、状元知道，有天朝使命到了。（白敏中云）快排香案，接待天使。（正旦唱）愿万万载民安国泰。",
            "output": "【太平领】我家小姐娇媚动人，新状元心胸广阔。因拥恩宠而晋升，与伴侣相配让人感激不尽。她的美丽啊，威武啊，都是神明慈爱所决定的。（府上官员上仙）啊！告诉夫人和状元，天朝的使命到了。（白敏中说）快快整理香案，迎接天使。（正旦唱）希望百万年间人民安居乐业，国家繁荣富强。",
        },
        {
            "input": "王文正公。每荐寇莱公准。而寇数短公。一日真宗谓公曰。卿虽称准。准不称卿也。公曰。臣在位久。阙失多。准对阶下无隐。益见其忠直。此臣所以重准耳。上由是益贤公。先是公在中书。寇在密院。中书偶倒用印。密院勾吏行遣。他日密院亦倒用印。中书吏亦呈行遣。公问汝等且道密院当初行遣。是否。曰。不是。公曰。既不是。不要学他不是。",
            "output": "王文正公。每次推荐寇莱公准。而寇莱公常常小看王文正公。有一天真宗对王文正公说道：你虽然称赞准，但准并不称赞你。王文正公回答道：臣在官位上已经很久了，也犯了很多错误。准对我从来没有隐藏过。越来越看到他的忠诚和直率。这是我为什么看重准的原因。由此，皇帝对王文正公更加认为他贤明。最初，王文正公在中书管事，寇莱公在密院任职。有一次中书的印章被倒用到密院，密院的印章被授与中书的吏员。后来，密院又倒用了中书的印章，中书的吏员也呈上了密院的印信。王文正公问你们一起来说说密院最初是怎样使用印章的。是否是这样的情况。他们回答道：不是。王文正公说道：既然不是这样的情况，就不要学他们做不正确的事情。"
        },
    ]

    print('-' * 50)
    for text in texts:
        now_time = time.time()
        translated_text = translate(text["input"], tokenizer, model, config)
        print("原文：", text["input"])
        print("译文：", text["output"])
        print("模型翻译：", translated_text)
        print(bleu_score(translated_text, text["output"]), f"\ttime: {time.time() - now_time :.2f}s",)
        print("-" * 50)



def demo(text):
    config = Config()
    tokenizer, model = load_model(config.model_path, config)
    print(f"原文：{text}")
    print(f"译文：{translate(text, tokenizer, model, config)}")



if __name__ == '__main__':
    test()
    demo("晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷。渔人甚异之。复前行，欲穷其林。林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。土地平旷，屋舍俨然，有良田美池桑竹之属。阡陌交通，鸡犬相闻。其中往来种作，男女衣着，悉如外人。黄发垂髫，并怡然自乐。见渔人，乃大惊，问所从来。具答之。便要还家，设酒杀鸡作食。村中闻有此人，咸来问讯。自云先世避秦时乱，率妻子邑人来此绝境，不复出焉，遂与外人间隔。问今是何世，乃不知有汉，无论魏晋。此人一一为具言所闻，皆叹惋。余人各复延至其家，皆出酒食。停数日，辞去。此中人语云：“不足为外人道也。”既出，得其船，便扶向路，处处志之。及郡下，诣太守，说如此。太守即遣人随其往，寻向所志，遂迷，不复得路。南阳刘子骥，高尚士也，闻之，欣然规往。未果，寻病终。后遂无问津者。")
